## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_management_group.mg_backend_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_management_group" "mg_backend_id" {
      + all_management_group_ids   = (known after apply)
      + all_subscription_ids       = (known after apply)
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + management_group_ids       = (known after apply)
      + name                       = "mg-backend"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.mg_backend will be created
  + resource "azurerm_management_group" "mg_backend" {
      + display_name               = "mg-backend"
      + id                         = (known after apply)
      + name                       = "mg-backend"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-miszel"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group_subscription_association.sub_backend_assoc will be created
  + resource "azurerm_management_group_subscription_association" "sub_backend_assoc" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/2745b794-365d-4993-9eec-fe3f9879434b"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>